// -------------------------------------------------------------------------------
// 
// 		ＤＸライブラリ		Android用標準関数の互換関数プログラムヘッダファイル
// 
// 				Ver 3.18e
// 
// -------------------------------------------------------------------------------

#ifndef __DXBASEFUNCANDROID_H__
#define __DXBASEFUNCANDROID_H__

// インクルード ------------------------------------------------------------------
#include "../DxCompileConfig.h"
#include "../DxBaseFunc.h"

#ifndef DX_NON_NAMESPACE

namespace DxLib
{

#endif // DX_NON_NAMESPACE

// マクロ定義 --------------------------------------------------------------------

#define ANDROID_WCHAR_CHARCODEFORMAT		(DX_CHARCODEFORMAT_UTF32LE)

// 構造体定義 --------------------------------------------------------------------

// テーブル-----------------------------------------------------------------------

// 内部大域変数宣言 --------------------------------------------------------------

// 関数プロトタイプ宣言-----------------------------------------------------------


#ifndef DX_NON_NAMESPACE

}

#endif // DX_NON_NAMESPACE

#endif // __DXBASEFUNCANDROID_H__
