// -------------------------------------------------------------------------------
// 
// 		ＤＸライブラリ		Android用BaseImageプログラムヘッダファイル
// 
// 				Ver 3.18e
// 
// -------------------------------------------------------------------------------

#ifndef __DXBASEIMAGEANDROID_H__
#define __DXBASEIMAGEANDROID_H__

// インクルード ------------------------------------------------------------------
#include "../DxCompileConfig.h"
#include "../DxLib.h"

#ifndef DX_NON_NAMESPACE

namespace DxLib
{

#endif // DX_NON_NAMESPACE

// マクロ定義 --------------------------------------------------------------------

// 構造体定義 --------------------------------------------------------------------

// 内部大域変数宣言 --------------------------------------------------------------

// 関数プロトタイプ宣言-----------------------------------------------------------

#ifndef DX_NON_NAMESPACE

}

#endif // DX_NON_NAMESPACE

#endif // __DXBASEIMAGEANDROID_H__
