// -------------------------------------------------------------------------------
// 
// 		ＤＸライブラリ		Android用ログプログラムヘッダファイル
// 
// 				Ver 3.18e
// 
// -------------------------------------------------------------------------------

#ifndef __DXLOGANDROID_H__
#define __DXLOGANDROID_H__

// インクルード ------------------------------------------------------------------
#include "../DxCompileConfig.h"

#ifndef DX_NON_LOG

#ifndef DX_NON_NAMESPACE

namespace DxLib
{

#endif // DX_NON_NAMESPACE

// マクロ定義 --------------------------------------------------------------------

// 構造体定義 --------------------------------------------------------------------

// Android用ログ処理データ構造体
struct LOGDATA_ANDR
{
	int		InitializeFlag ;
	char	ExternalDataPath[ 2048 ] ;
	FILE	*fp ;
} ;

// テーブル-----------------------------------------------------------------------

// 内部大域変数宣言 --------------------------------------------------------------

extern LOGDATA_ANDR LogData_Android ;

// 関数プロトタイプ宣言-----------------------------------------------------------

#ifndef DX_NON_NAMESPACE

}

#endif // DX_NON_NAMESPACE

#endif // DX_NON_LOG

#endif // __DXLOGANDROID_H__
